import pandas as pd
import numpy as np

df = pd.DataFrame({
 'имя': ['Петя', 'Вася', 'Аня', 'Света'],
 'возраст': [45, 26, 41, 21],
 'доход': [100000, 80000, 150000, 60000],
 'надежность клиента (0..1)': [0.65, 0.74, 0.87, 0.68],
 'пол': ['муж', 'муж', 'жен', 'жен']},
 index=[0, 1, 2, 3])

df['важность клиента'] = df['доход']* df['надежность клиента (0..1)']
df['возможная долгосрочность клиента'] = df['важность клиента']*(df['возраст'].mean()-df['возраст'])

#всех, кто старше 40
print(df[df['возраст'] > 40])
print('-----------------------')

#всех, кто имеет доход выше среднего по датасету
print(df[df['доход'] > df['доход'].mean()])
print('-----------------------')

#всех, кто имеет доход выше среднего по датасету
print(df[(df['доход'] > df['доход'].mean()) & (df['надежность клиента (0..1)'] < df['надежность клиента (0..1)'].mean())])
print('-----------------------')

print(df)